In [1]:
import io
import pandas as pd

In [2]:
data = u"""name|age|height|class|score
lily|28|168|english|90
lily|28|168|math|95
lucy|28|120|english|99
lucy|28|120|math|88
sun|27|161|english|98
sun|27|161|math|78
vincent|32|175|english|60
vincent|32|175|math|100
"""
d = pd.read_table(io.StringIO(data),sep='|')

In [3]:
d

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100

In [4]:
d.to_json()

'{"name":{"0":"lily","1":"lily","2":"lucy","3":"lucy","4":"sun","5":"sun","6":"vincent","7":"vincent"},"age":{"0":28,"1":28,"2":28,"3":28,"4":27,"5":27,"6":32,"7":32},"height":{"0":168,"1":168,"2":120,"3":120,"4":161,"5":161,"6":175,"7":175},"class":{"0":"english","1":"math","2":"english","3":"math","4":"english","5":"math","6":"english","7":"math"},"score":{"0":90,"1":95,"2":99,"3":88,"4":98,"5":78,"6":60,"7":100}}'

In [5]:
d.to_html("d.html")

# Numpy

In [6]:
d.as_matrix()

array([['lily', 28L, 168L, 'english', 90L],
       ['lily', 28L, 168L, 'math', 95L],
       ['lucy', 28L, 120L, 'english', 99L],
       ['lucy', 28L, 120L, 'math', 88L],
       ['sun', 27L, 161L, 'english', 98L],
       ['sun', 27L, 161L, 'math', 78L],
       ['vincent', 32L, 175L, 'english', 60L],
       ['vincent', 32L, 175L, 'math', 100L]], dtype=object)

In [7]:
pd.DataFrame(d.as_matrix(), columns=["name","age","height","class","score"])

      name age height    class score
0     lily  28    168  english    90
1     lily  28    168     math    95
2     lucy  28    120  english    99
3     lucy  28    120     math    88
4      sun  27    161  english    98
5      sun  27    161     math    78
6  vincent  32    175  english    60
7  vincent  32    175     math   100

# excel

In [9]:
d.to_excel("d.xls")

In [10]:
pd.read_excel("d.xls")

      name  age  height    class  score
0     lily   28     168  english     90
1     lily   28     168     math     95
2     lucy   28     120  english     99
3     lucy   28     120     math     88
4      sun   27     161  english     98
5      sun   27     161     math     78
6  vincent   32     175  english     60
7  vincent   32     175     math    100